{"clean_prefix": "Then, Richard and Erica went to the hospital. Richard gave a drink to", "patch_prefix": "Then, Matthew and Crystal went to the hospital. Megan gave a drink to", "clean_answer": " Erica", "patch_answer": " Richard", "case": "BABA_16"}
{"clean_prefix": "Then, John and Eric went to the station. John gave a bone to", "patch_prefix": "Then, Rachel and Andrea went to the station. Megan gave a bone to", "clean_answer": " Eric", "patch_answer": " John", "case": "BABA_16"}
{"clean_prefix": "Then, Jason and Jamie went to the garden. Jason gave a necklace to", "patch_prefix": "Then, Michael and Jonathan went to the garden. Michelle gave a necklace to", "clean_answer": " Jamie", "patch_answer": " Jason", "case": "BABA_16"}
{"clean_prefix": "Then, Matthew and Jennifer went to the station. Matthew gave a kiss to", "patch_prefix": "Then, Katherine and Alicia went to the station. Katherine gave a kiss to", "clean_answer": " Jennifer", "patch_answer": " Matthew", "case": "BABA_16"}
{"clean_prefix": "Then, Lisa and Jason went to the restaurant. Lisa gave a computer to", "patch_prefix": "Then, Christine and Justin went to the restaurant. Kyle gave a computer to", "clean_answer": " Jason", "patch_answer": " Lisa", "case": "BABA_16"}
{"clean_prefix": "Then, Richard and Kyle went to the station. Richard gave a necklace to", "patch_prefix": "Then, Mary and Erin went to the station. Sara gave a necklace to", "clean_answer": " Kyle", "patch_answer": " Richard", "case": "BABA_16"}
{"clean_prefix": "Then, Joseph and Amber went to the garden. Joseph gave a computer to", "patch_prefix": "Then, Michael and Lindsay went to the garden. Rachel gave a computer to", "clean_answer": " Amber", "patch_answer": " Joseph", "case": "BABA_16"}
{"clean_prefix": "Then, Anthony and Mark went to the house. Anthony gave a basketball to", "patch_prefix": "Then, Elizabeth and Laura went to the house. Robert gave a basketball to", "clean_answer": " Mark", "patch_answer": " Anthony", "case": "BABA_16"}
{"clean_prefix": "Then, Brittany and Shannon went to the station. Brittany gave a bone to", "patch_prefix": "Then, Charles and Aaron went to the station. Timothy gave a bone to", "clean_answer": " Shannon", "patch_answer": " Brittany", "case": "BABA_16"}
{"clean_prefix": "Then, Andrea and Sara went to the station. Andrea gave a necklace to", "patch_prefix": "Then, Adam and Erin went to the station. Bryan gave a necklace to", "clean_answer": " Sara", "patch_answer": " Andrea", "case": "BABA_16"}
{"clean_prefix": "Then, Kristen and Robert went to the restaurant. Kristen gave a computer to", "patch_prefix": "Then, Justin and Andrew went to the restaurant. Andrea gave a computer to", "clean_answer": " Robert", "patch_answer": " Kristen", "case": "BABA_16"}
{"clean_prefix": "Then, Lindsey and Kristen went to the restaurant. Lindsey gave a bone to", "patch_prefix": "Then, Andrea and Kelly went to the restaurant. Rebecca gave a bone to", "clean_answer": " Kristen", "patch_answer": " Lindsey", "case": "BABA_16"}
{"clean_prefix": "Then, Adam and Stephen went to the hospital. Adam gave a kiss to", "patch_prefix": "Then, David and Timothy went to the hospital. Lisa gave a kiss to", "clean_answer": " Stephen", "patch_answer": " Adam", "case": "BABA_16"}
{"clean_prefix": "Then, Cody and Amy went to the house. Cody gave a snack to", "patch_prefix": "Then, David and Nicholas went to the house. Eric gave a snack to", "clean_answer": " Amy", "patch_answer": " Cody", "case": "BABA_16"}
{"clean_prefix": "Then, Lisa and Sarah went to the house. Lisa gave a kiss to", "patch_prefix": "Then, Gregory and Tyler went to the house. Daniel gave a kiss to", "clean_answer": " Sarah", "patch_answer": " Lisa", "case": "BABA_16"}
{"clean_prefix": "Then, Courtney and William went to the school. Courtney gave a necklace to", "patch_prefix": "Then, Jesse and Sarah went to the school. Alicia gave a necklace to", "clean_answer": " William", "patch_answer": " Courtney", "case": "BABA_16"}
{"clean_prefix": "Then, Daniel and Elizabeth went to the station. Daniel gave a drink to", "patch_prefix": "Then, Heather and Amanda went to the station. Jacob gave a drink to", "clean_answer": " Elizabeth", "patch_answer": " Daniel", "case": "BABA_16"}
{"clean_prefix": "Then, Allison and Kimberly went to the garden. Allison gave a necklace to", "patch_prefix": "Then, Nicholas and Jeremy went to the garden. Rebecca gave a necklace to", "clean_answer": " Kimberly", "patch_answer": " Allison", "case": "BABA_16"}
{"clean_prefix": "Then, Adam and Nicholas went to the office. Adam gave a snack to", "patch_prefix": "Then, Kristen and Courtney went to the office. Justin gave a snack to", "clean_answer": " Nicholas", "patch_answer": " Adam", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and Brian went to the garden. Steven gave a computer to", "patch_prefix": "Then, Nicole and Tyler went to the garden. Christopher gave a computer to", "clean_answer": " Brian", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, James and Michael went to the store. James gave a bone to", "patch_prefix": "Then, Jacob and Brian went to the store. Patrick gave a bone to", "clean_answer": " Michael", "patch_answer": " James", "case": "BABA_16"}
{"clean_prefix": "Then, Lauren and Amanda went to the school. Lauren gave a kiss to", "patch_prefix": "Then, Brittany and Patrick went to the school. Brandon gave a kiss to", "clean_answer": " Amanda", "patch_answer": " Lauren", "case": "BABA_16"}
{"clean_prefix": "Then, Elizabeth and Bradley went to the restaurant. Elizabeth gave a necklace to", "patch_prefix": "Then, Travis and Benjamin went to the restaurant. Heather gave a necklace to", "clean_answer": " Bradley", "patch_answer": " Elizabeth", "case": "BABA_16"}
{"clean_prefix": "Then, Courtney and Michelle went to the school. Courtney gave a ring to", "patch_prefix": "Then, Jonathan and Richard went to the school. Michael gave a ring to", "clean_answer": " Michelle", "patch_answer": " Courtney", "case": "BABA_16"}
{"clean_prefix": "Then, Kenneth and Katherine went to the office. Kenneth gave a computer to", "patch_prefix": "Then, Samuel and Jeffrey went to the office. Nicholas gave a computer to", "clean_answer": " Katherine", "patch_answer": " Kenneth", "case": "BABA_16"}
{"clean_prefix": "Then, Jacob and Vanessa went to the hospital. Jacob gave a drink to", "patch_prefix": "Then, Samuel and Michelle went to the hospital. Danielle gave a drink to", "clean_answer": " Vanessa", "patch_answer": " Jacob", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and David went to the restaurant. Steven gave a bone to", "patch_prefix": "Then, Sarah and Brittany went to the restaurant. Tyler gave a bone to", "clean_answer": " David", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, Samantha and Joshua went to the garden. Samantha gave a kiss to", "patch_prefix": "Then, Jeffrey and Mary went to the garden. Amber gave a kiss to", "clean_answer": " Joshua", "patch_answer": " Samantha", "case": "BABA_16"}
{"clean_prefix": "Then, Tyler and Justin went to the office. Tyler gave a necklace to", "patch_prefix": "Then, Joshua and Lindsay went to the office. Bradley gave a necklace to", "clean_answer": " Justin", "patch_answer": " Tyler", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and John went to the restaurant. Amy gave a necklace to", "patch_prefix": "Then, Sara and Aaron went to the restaurant. Timothy gave a necklace to", "clean_answer": " John", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Eric and Erica went to the station. Eric gave a computer to", "patch_prefix": "Then, Scott and Tyler went to the station. Sara gave a computer to", "clean_answer": " Erica", "patch_answer": " Eric", "case": "BABA_16"}
{"clean_prefix": "Then, Benjamin and Jason went to the school. Benjamin gave a bone to", "patch_prefix": "Then, Nicole and Michelle went to the school. Vanessa gave a bone to", "clean_answer": " Jason", "patch_answer": " Benjamin", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and Katie went to the office. Steven gave a bone to", "patch_prefix": "Then, Jeffrey and Shannon went to the office. Joseph gave a bone to", "clean_answer": " Katie", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, Mark and Amber went to the garden. Mark gave a necklace to", "patch_prefix": "Then, Shannon and Timothy went to the garden. Tyler gave a necklace to", "clean_answer": " Amber", "patch_answer": " Mark", "case": "BABA_16"}
{"clean_prefix": "Then, Erica and Patrick went to the hospital. Erica gave a basketball to", "patch_prefix": "Then, Vanessa and Crystal went to the hospital. Joshua gave a basketball to", "clean_answer": " Patrick", "patch_answer": " Erica", "case": "BABA_16"}
{"clean_prefix": "Then, Thomas and Angela went to the store. Thomas gave a bone to", "patch_prefix": "Then, Samuel and Kenneth went to the store. John gave a bone to", "clean_answer": " Angela", "patch_answer": " Thomas", "case": "BABA_16"}
{"clean_prefix": "Then, Angela and Alicia went to the office. Angela gave a snack to", "patch_prefix": "Then, Stephanie and Cody went to the office. Samuel gave a snack to", "clean_answer": " Alicia", "patch_answer": " Angela", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and Crystal went to the hospital. Steven gave a ring to", "patch_prefix": "Then, Eric and Katherine went to the hospital. Matthew gave a ring to", "clean_answer": " Crystal", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, Lauren and Erica went to the house. Lauren gave a ring to", "patch_prefix": "Then, Lindsay and Robert went to the house. Laura gave a ring to", "clean_answer": " Erica", "patch_answer": " Lauren", "case": "BABA_16"}
{"clean_prefix": "Then, Angela and Katie went to the restaurant. Angela gave a kiss to", "patch_prefix": "Then, Thomas and Katherine went to the restaurant. Benjamin gave a kiss to", "clean_answer": " Katie", "patch_answer": " Angela", "case": "BABA_16"}
{"clean_prefix": "Then, Andrew and Megan went to the station. Andrew gave a basketball to", "patch_prefix": "Then, Andrea and Gregory went to the station. Stephanie gave a basketball to", "clean_answer": " Megan", "patch_answer": " Andrew", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Amy went to the office. Amber gave a computer to", "patch_prefix": "Then, Tiffany and Rachel went to the office. Brian gave a computer to", "clean_answer": " Amy", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Courtney and Stephanie went to the hospital. Courtney gave a basketball to", "patch_prefix": "Then, Alicia and Kimberly went to the hospital. Paul gave a basketball to", "clean_answer": " Stephanie", "patch_answer": " Courtney", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Richard went to the restaurant. Alicia gave a computer to", "patch_prefix": "Then, Jennifer and Tiffany went to the restaurant. Joshua gave a computer to", "clean_answer": " Richard", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Crystal and Brian went to the garden. Crystal gave a kiss to", "patch_prefix": "Then, Vanessa and Vanessa went to the garden. Gregory gave a kiss to", "clean_answer": " Brian", "patch_answer": " Crystal", "case": "BABA_16"}
{"clean_prefix": "Then, Daniel and Sara went to the office. Daniel gave a snack to", "patch_prefix": "Then, Benjamin and Matthew went to the office. Jason gave a snack to", "clean_answer": " Sara", "patch_answer": " Daniel", "case": "BABA_16"}
{"clean_prefix": "Then, Jonathan and Samuel went to the store. Jonathan gave a snack to", "patch_prefix": "Then, Kelly and Brandon went to the store. Cody gave a snack to", "clean_answer": " Samuel", "patch_answer": " Jonathan", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Lindsey went to the school. Joshua gave a bone to", "patch_prefix": "Then, Anthony and Jamie went to the school. Christina gave a bone to", "clean_answer": " Lindsey", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Dustin and Jeffrey went to the office. Dustin gave a computer to", "patch_prefix": "Then, Rachel and Kyle went to the office. Katherine gave a computer to", "clean_answer": " Jeffrey", "patch_answer": " Dustin", "case": "BABA_16"}
{"clean_prefix": "Then, Kyle and Katherine went to the house. Kyle gave a necklace to", "patch_prefix": "Then, Bradley and Ashley went to the house. Ashley gave a necklace to", "clean_answer": " Katherine", "patch_answer": " Kyle", "case": "BABA_16"}
{"clean_prefix": "Then, Thomas and Amber went to the office. Thomas gave a kiss to", "patch_prefix": "Then, Jeffrey and Matthew went to the office. Cody gave a kiss to", "clean_answer": " Amber", "patch_answer": " Thomas", "case": "BABA_16"}
{"clean_prefix": "Then, Jennifer and Jose went to the restaurant. Jennifer gave a drink to", "patch_prefix": "Then, Michael and Nicole went to the restaurant. Bradley gave a drink to", "clean_answer": " Jose", "patch_answer": " Jennifer", "case": "BABA_16"}
{"clean_prefix": "Then, Michelle and Jennifer went to the hospital. Michelle gave a bone to", "patch_prefix": "Then, Tiffany and Stephanie went to the hospital. Sarah gave a bone to", "clean_answer": " Jennifer", "patch_answer": " Michelle", "case": "BABA_16"}
{"clean_prefix": "Then, Ryan and Nicholas went to the office. Ryan gave a necklace to", "patch_prefix": "Then, Brandon and Tyler went to the office. Brandon gave a necklace to", "clean_answer": " Nicholas", "patch_answer": " Ryan", "case": "BABA_16"}
{"clean_prefix": "Then, Andrew and Amy went to the station. Andrew gave a bone to", "patch_prefix": "Then, Cody and Kyle went to the station. Andrew gave a bone to", "clean_answer": " Amy", "patch_answer": " Andrew", "case": "BABA_16"}
{"clean_prefix": "Then, Tiffany and Kelly went to the school. Tiffany gave a kiss to", "patch_prefix": "Then, Kelly and Jonathan went to the school. Jeffrey gave a kiss to", "clean_answer": " Kelly", "patch_answer": " Tiffany", "case": "BABA_16"}
{"clean_prefix": "Then, Jonathan and Sarah went to the store. Jonathan gave a necklace to", "patch_prefix": "Then, Melissa and Ashley went to the store. Michael gave a necklace to", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"}
{"clean_prefix": "Then, Travis and Brandon went to the restaurant. Travis gave a drink to", "patch_prefix": "Then, Bradley and Megan went to the restaurant. Crystal gave a drink to", "clean_answer": " Brandon", "patch_answer": " Travis", "case": "BABA_16"}
{"clean_prefix": "Then, Aaron and Vanessa went to the hospital. Aaron gave a drink to", "patch_prefix": "Then, Sara and Christina went to the hospital. Andrea gave a drink to", "clean_answer": " Vanessa", "patch_answer": " Aaron", "case": "BABA_16"}
{"clean_prefix": "Then, Megan and Allison went to the hospital. Megan gave a basketball to", "patch_prefix": "Then, Alicia and Amanda went to the hospital. Danielle gave a basketball to", "clean_answer": " Allison", "patch_answer": " Megan", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Jesse went to the hospital. Amy gave a bone to", "patch_prefix": "Then, James and Cody went to the hospital. James gave a bone to", "clean_answer": " Jesse", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Shannon and Melissa went to the hospital. Shannon gave a kiss to", "patch_prefix": "Then, Jessica and Scott went to the hospital. Brian gave a kiss to", "clean_answer": " Melissa", "patch_answer": " Shannon", "case": "BABA_16"}
{"clean_prefix": "Then, Mark and Jamie went to the office. Mark gave a bone to", "patch_prefix": "Then, Kimberly and Tiffany went to the office. Jeffrey gave a bone to", "clean_answer": " Jamie", "patch_answer": " Mark", "case": "BABA_16"}
{"clean_prefix": "Then, Timothy and Ryan went to the hospital. Timothy gave a bone to", "patch_prefix": "Then, Patrick and Bryan went to the hospital. Nathan gave a bone to", "clean_answer": " Ryan", "patch_answer": " Timothy", "case": "BABA_16"}
{"clean_prefix": "Then, Jacob and Jason went to the office. Jacob gave a bone to", "patch_prefix": "Then, Brian and Nicholas went to the office. Alicia gave a bone to", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"}
{"clean_prefix": "Then, Rebecca and Samuel went to the station. Rebecca gave a necklace to", "patch_prefix": "Then, Patrick and Charles went to the station. Lisa gave a necklace to", "clean_answer": " Samuel", "patch_answer": " Rebecca", "case": "BABA_16"}
{"clean_prefix": "Then, Andrea and Jacob went to the garden. Andrea gave a kiss to", "patch_prefix": "Then, Timothy and Lindsay went to the garden. Amber gave a kiss to", "clean_answer": " Jacob", "patch_answer": " Andrea", "case": "BABA_16"}
{"clean_prefix": "Then, Sara and Andrew went to the restaurant. Sara gave a computer to", "patch_prefix": "Then, Vanessa and Jacob went to the restaurant. Emily gave a computer to", "clean_answer": " Andrew", "patch_answer": " Sara", "case": "BABA_16"}
{"clean_prefix": "Then, Brian and Brittany went to the store. Brian gave a necklace to", "patch_prefix": "Then, Thomas and Anthony went to the store. Megan gave a necklace to", "clean_answer": " Brittany", "patch_answer": " Brian", "case": "BABA_16"}
{"clean_prefix": "Then, Kelly and Joseph went to the school. Kelly gave a kiss to", "patch_prefix": "Then, Anthony and Brittany went to the school. Lindsey gave a kiss to", "clean_answer": " Joseph", "patch_answer": " Kelly", "case": "BABA_16"}
{"clean_prefix": "Then, Jesse and Alicia went to the station. Jesse gave a computer to", "patch_prefix": "Then, Sean and Melissa went to the station. Samantha gave a computer to", "clean_answer": " Alicia", "patch_answer": " Jesse", "case": "BABA_16"}
{"clean_prefix": "Then, Jose and Ashley went to the station. Jose gave a computer to", "patch_prefix": "Then, Christopher and Allison went to the station. Rachel gave a computer to", "clean_answer": " Ashley", "patch_answer": " Jose", "case": "BABA_16"}
{"clean_prefix": "Then, Christine and Richard went to the office. Christine gave a drink to", "patch_prefix": "Then, Matthew and Christopher went to the office. Patrick gave a drink to", "clean_answer": " Richard", "patch_answer": " Christine", "case": "BABA_16"}
{"clean_prefix": "Then, Michelle and Jessica went to the hospital. Michelle gave a drink to", "patch_prefix": "Then, Matthew and Jeffrey went to the hospital. Bradley gave a drink to", "clean_answer": " Jessica", "patch_answer": " Michelle", "case": "BABA_16"}
{"clean_prefix": "Then, Ryan and Dustin went to the store. Ryan gave a drink to", "patch_prefix": "Then, Samuel and Brittany went to the store. Danielle gave a drink to", "clean_answer": " Dustin", "patch_answer": " Ryan", "case": "BABA_16"}
{"clean_prefix": "Then, Brandon and Robert went to the hospital. Brandon gave a basketball to", "patch_prefix": "Then, Timothy and Shannon went to the hospital. Mark gave a basketball to", "clean_answer": " Robert", "patch_answer": " Brandon", "case": "BABA_16"}
{"clean_prefix": "Then, Thomas and Rebecca went to the house. Thomas gave a basketball to", "patch_prefix": "Then, Jennifer and Katherine went to the house. Gregory gave a basketball to", "clean_answer": " Rebecca", "patch_answer": " Thomas", "case": "BABA_16"}
{"clean_prefix": "Then, Charles and Courtney went to the restaurant. Charles gave a ring to", "patch_prefix": "Then, Katie and Jose went to the restaurant. Brandon gave a ring to", "clean_answer": " Courtney", "patch_answer": " Charles", "case": "BABA_16"}
{"clean_prefix": "Then, Jesse and Scott went to the garden. Jesse gave a necklace to", "patch_prefix": "Then, Lindsey and Rachel went to the garden. Lisa gave a necklace to", "clean_answer": " Scott", "patch_answer": " Jesse", "case": "BABA_16"}
{"clean_prefix": "Then, Melissa and Erin went to the office. Melissa gave a necklace to", "patch_prefix": "Then, Mark and Alicia went to the office. Joshua gave a necklace to", "clean_answer": " Erin", "patch_answer": " Melissa", "case": "BABA_16"}
{"clean_prefix": "Then, John and Elizabeth went to the garden. John gave a ring to", "patch_prefix": "Then, Lindsey and Michael went to the garden. Richard gave a ring to", "clean_answer": " Elizabeth", "patch_answer": " John", "case": "BABA_16"}
{"clean_prefix": "Then, Courtney and Andrea went to the house. Courtney gave a snack to", "patch_prefix": "Then, Brian and Kenneth went to the house. Kristen gave a snack to", "clean_answer": " Andrea", "patch_answer": " Courtney", "case": "BABA_16"}
{"clean_prefix": "Then, Kyle and Mary went to the hospital. Kyle gave a drink to", "patch_prefix": "Then, Alicia and John went to the hospital. Gregory gave a drink to", "clean_answer": " Mary", "patch_answer": " Kyle", "case": "BABA_16"}
{"clean_prefix": "Then, Scott and Rebecca went to the school. Scott gave a drink to", "patch_prefix": "Then, Adam and Vanessa went to the school. Benjamin gave a drink to", "clean_answer": " Rebecca", "patch_answer": " Scott", "case": "BABA_16"}
{"clean_prefix": "Then, Rachel and Andrea went to the garden. Rachel gave a drink to", "patch_prefix": "Then, Amber and Jeffrey went to the garden. Justin gave a drink to", "clean_answer": " Andrea", "patch_answer": " Rachel", "case": "BABA_16"}
{"clean_prefix": "Then, Alexander and Scott went to the store. Alexander gave a ring to", "patch_prefix": "Then, Ashley and Megan went to the store. Jessica gave a ring to", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"}
{"clean_prefix": "Then, Cody and Rachel went to the garden. Cody gave a ring to", "patch_prefix": "Then, Heather and Steven went to the garden. Anthony gave a ring to", "clean_answer": " Rachel", "patch_answer": " Cody", "case": "BABA_16"}
{"clean_prefix": "Then, Tiffany and Cody went to the station. Tiffany gave a snack to", "patch_prefix": "Then, Katherine and Amber went to the station. Joseph gave a snack to", "clean_answer": " Cody", "patch_answer": " Tiffany", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Paul went to the office. Joshua gave a necklace to", "patch_prefix": "Then, Joshua and Danielle went to the office. Christina gave a necklace to", "clean_answer": " Paul", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Danielle and Megan went to the garden. Danielle gave a ring to", "patch_prefix": "Then, Brian and Eric went to the garden. John gave a ring to", "clean_answer": " Megan", "patch_answer": " Danielle", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Alexander went to the hospital. Christopher gave a basketball to", "patch_prefix": "Then, Angela and Aaron went to the hospital. Paul gave a basketball to", "clean_answer": " Alexander", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Joseph and Jacob went to the house. Joseph gave a ring to", "patch_prefix": "Then, Adam and David went to the house. Jeffrey gave a ring to", "clean_answer": " Jacob", "patch_answer": " Joseph", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Joshua went to the school. Alicia gave a snack to", "patch_prefix": "Then, Kyle and Timothy went to the school. Shannon gave a snack to", "clean_answer": " Joshua", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Alexander went to the store. Amy gave a basketball to", "patch_prefix": "Then, John and Eric went to the store. Brandon gave a basketball to", "clean_answer": " Alexander", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Megan and Angela went to the office. Megan gave a bone to", "patch_prefix": "Then, Jamie and Jamie went to the office. Cody gave a bone to", "clean_answer": " Angela", "patch_answer": " Megan", "case": "BABA_16"}
{"clean_prefix": "Then, Erin and Scott went to the station. Erin gave a drink to", "patch_prefix": "Then, Tyler and Katherine went to the station. Alicia gave a drink to", "clean_answer": " Scott", "patch_answer": " Erin", "case": "BABA_16"}
{"clean_prefix": "Then, Kevin and Charles went to the store. Kevin gave a necklace to", "patch_prefix": "Then, Matthew and Joseph went to the store. Kyle gave a necklace to", "clean_answer": " Charles", "patch_answer": " Kevin", "case": "BABA_16"}
{"clean_prefix": "Then, Jason and James went to the restaurant. Jason gave a drink to", "patch_prefix": "Then, Paul and Jesse went to the restaurant. Paul gave a drink to", "clean_answer": " James", "patch_answer": " Jason", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Andrea went to the office. Christopher gave a necklace to", "patch_prefix": "Then, William and Kenneth went to the office. Erin gave a necklace to", "clean_answer": " Andrea", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Alexander and Scott went to the office. Alexander gave a necklace to", "patch_prefix": "Then, Rebecca and Matthew went to the office. Kelly gave a necklace to", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"}
{"clean_prefix": "Then, Nicole and Jeremy went to the hospital. Nicole gave a bone to", "patch_prefix": "Then, Jessica and Samuel went to the hospital. Jonathan gave a bone to", "clean_answer": " Jeremy", "patch_answer": " Nicole", "case": "BABA_16"}
{"clean_prefix": "Then, Brian and Nathan went to the restaurant. Brian gave a kiss to", "patch_prefix": "Then, Jose and Lisa went to the restaurant. Kimberly gave a kiss to", "clean_answer": " Nathan", "patch_answer": " Brian", "case": "BABA_16"}
{"clean_prefix": "Then, Charles and Brittany went to the garden. Charles gave a necklace to", "patch_prefix": "Then, Bryan and Bryan went to the garden. Anthony gave a necklace to", "clean_answer": " Brittany", "patch_answer": " Charles", "case": "BABA_16"}
{"clean_prefix": "Then, William and Nicholas went to the station. William gave a drink to", "patch_prefix": "Then, Charles and Thomas went to the station. Kristen gave a drink to", "clean_answer": " Nicholas", "patch_answer": " William", "case": "BABA_16"}
{"clean_prefix": "Then, Michael and Bradley went to the restaurant. Michael gave a ring to", "patch_prefix": "Then, Brittany and Benjamin went to the restaurant. Steven gave a ring to", "clean_answer": " Bradley", "patch_answer": " Michael", "case": "BABA_16"}
{"clean_prefix": "Then, Mary and Tiffany went to the station. Mary gave a drink to", "patch_prefix": "Then, Christine and Kimberly went to the station. Heather gave a drink to", "clean_answer": " Tiffany", "patch_answer": " Mary", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Jeffrey went to the house. Christopher gave a basketball to", "patch_prefix": "Then, Patrick and Katherine went to the house. Sean gave a basketball to", "clean_answer": " Jeffrey", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Erica and Eric went to the restaurant. Erica gave a computer to", "patch_prefix": "Then, Erica and Katherine went to the restaurant. Amy gave a computer to", "clean_answer": " Eric", "patch_answer": " Erica", "case": "BABA_16"}
{"clean_prefix": "Then, Brandon and Samuel went to the station. Brandon gave a necklace to", "patch_prefix": "Then, John and David went to the station. Jacob gave a necklace to", "clean_answer": " Samuel", "patch_answer": " Brandon", "case": "BABA_16"}
{"clean_prefix": "Then, Brian and Katie went to the station. Brian gave a ring to", "patch_prefix": "Then, Melissa and Megan went to the station. David gave a ring to", "clean_answer": " Katie", "patch_answer": " Brian", "case": "BABA_16"}
{"clean_prefix": "Then, Danielle and William went to the restaurant. Danielle gave a ring to", "patch_prefix": "Then, Andrea and Charles went to the restaurant. Steven gave a ring to", "clean_answer": " William", "patch_answer": " Danielle", "case": "BABA_16"}
{"clean_prefix": "Then, Melissa and Brandon went to the hospital. Melissa gave a computer to", "patch_prefix": "Then, Jason and Jonathan went to the hospital. Paul gave a computer to", "clean_answer": " Brandon", "patch_answer": " Melissa", "case": "BABA_16"}
{"clean_prefix": "Then, Thomas and Amanda went to the office. Thomas gave a kiss to", "patch_prefix": "Then, Sara and Bradley went to the office. Lauren gave a kiss to", "clean_answer": " Amanda", "patch_answer": " Thomas", "case": "BABA_16"}
{"clean_prefix": "Then, Brittany and Matthew went to the house. Brittany gave a snack to", "patch_prefix": "Then, Jeffrey and Lauren went to the house. Joshua gave a snack to", "clean_answer": " Matthew", "patch_answer": " Brittany", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Jennifer went to the house. Christopher gave a necklace to", "patch_prefix": "Then, Amy and Jeremy went to the house. Matthew gave a necklace to", "clean_answer": " Jennifer", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Jeffrey went to the house. Amber gave a kiss to", "patch_prefix": "Then, Timothy and Brian went to the house. Andrea gave a kiss to", "clean_answer": " Jeffrey", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Paul and Travis went to the school. Paul gave a necklace to", "patch_prefix": "Then, Christine and Tyler went to the school. Robert gave a necklace to", "clean_answer": " Travis", "patch_answer": " Paul", "case": "BABA_16"}
{"clean_prefix": "Then, Tyler and Jeremy went to the garden. Tyler gave a drink to", "patch_prefix": "Then, Thomas and Stephen went to the garden. Mary gave a drink to", "clean_answer": " Jeremy", "patch_answer": " Tyler", "case": "BABA_16"}
{"clean_prefix": "Then, Robert and Brittany went to the restaurant. Robert gave a computer to", "patch_prefix": "Then, Angela and Jeffrey went to the restaurant. Lindsey gave a computer to", "clean_answer": " Brittany", "patch_answer": " Robert", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Kristen went to the school. Alicia gave a drink to", "patch_prefix": "Then, Jamie and Ryan went to the school. Anthony gave a drink to", "clean_answer": " Kristen", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Joseph and Kelly went to the office. Joseph gave a necklace to", "patch_prefix": "Then, Daniel and Alicia went to the office. Thomas gave a necklace to", "clean_answer": " Kelly", "patch_answer": " Joseph", "case": "BABA_16"}
{"clean_prefix": "Then, Emily and Kevin went to the garden. Emily gave a ring to", "patch_prefix": "Then, Joshua and Michael went to the garden. Jason gave a ring to", "clean_answer": " Kevin", "patch_answer": " Emily", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Lauren went to the hospital. Amber gave a kiss to", "patch_prefix": "Then, Amanda and Lindsey went to the hospital. Lisa gave a kiss to", "clean_answer": " Lauren", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Scott and Kyle went to the garden. Scott gave a drink to", "patch_prefix": "Then, Tiffany and Joshua went to the garden. James gave a drink to", "clean_answer": " Kyle", "patch_answer": " Scott", "case": "BABA_16"}
{"clean_prefix": "Then, Vanessa and Jennifer went to the store. Vanessa gave a snack to", "patch_prefix": "Then, Bryan and Nathan went to the store. Scott gave a snack to", "clean_answer": " Jennifer", "patch_answer": " Vanessa", "case": "BABA_16"}
{"clean_prefix": "Then, Christina and Vanessa went to the station. Christina gave a snack to", "patch_prefix": "Then, Matthew and Brandon went to the station. Anthony gave a snack to", "clean_answer": " Vanessa", "patch_answer": " Christina", "case": "BABA_16"}
{"clean_prefix": "Then, Stephen and Lindsey went to the station. Stephen gave a basketball to", "patch_prefix": "Then, Daniel and Nathan went to the station. Tiffany gave a basketball to", "clean_answer": " Lindsey", "patch_answer": " Stephen", "case": "BABA_16"}
{"clean_prefix": "Then, Charles and Rachel went to the house. Charles gave a basketball to", "patch_prefix": "Then, Matthew and Kenneth went to the house. Jose gave a basketball to", "clean_answer": " Rachel", "patch_answer": " Charles", "case": "BABA_16"}
{"clean_prefix": "Then, Travis and Jeremy went to the station. Travis gave a necklace to", "patch_prefix": "Then, Crystal and Nathan went to the station. Stephanie gave a necklace to", "clean_answer": " Jeremy", "patch_answer": " Travis", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Angela went to the house. Amy gave a computer to", "patch_prefix": "Then, Michelle and William went to the house. Courtney gave a computer to", "clean_answer": " Angela", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Jennifer and Brittany went to the office. Jennifer gave a kiss to", "patch_prefix": "Then, James and Vanessa went to the office. Brittany gave a kiss to", "clean_answer": " Brittany", "patch_answer": " Jennifer", "case": "BABA_16"}
{"clean_prefix": "Then, Scott and John went to the store. Scott gave a basketball to", "patch_prefix": "Then, Brittany and Courtney went to the store. Joshua gave a basketball to", "clean_answer": " John", "patch_answer": " Scott", "case": "BABA_16"}
{"clean_prefix": "Then, Adam and Paul went to the station. Adam gave a computer to", "patch_prefix": "Then, Vanessa and Andrew went to the station. Erica gave a computer to", "clean_answer": " Paul", "patch_answer": " Adam", "case": "BABA_16"}
{"clean_prefix": "Then, Michelle and Brandon went to the station. Michelle gave a kiss to", "patch_prefix": "Then, Bryan and Erin went to the station. Laura gave a kiss to", "clean_answer": " Brandon", "patch_answer": " Michelle", "case": "BABA_16"}
{"clean_prefix": "Then, Bradley and Elizabeth went to the restaurant. Bradley gave a drink to", "patch_prefix": "Then, Sean and Brittany went to the restaurant. Alicia gave a drink to", "clean_answer": " Elizabeth", "patch_answer": " Bradley", "case": "BABA_16"}
{"clean_prefix": "Then, Emily and Kelly went to the hospital. Emily gave a drink to", "patch_prefix": "Then, Lindsay and Melissa went to the hospital. Travis gave a drink to", "clean_answer": " Kelly", "patch_answer": " Emily", "case": "BABA_16"}
{"clean_prefix": "Then, Kenneth and Jonathan went to the hospital. Kenneth gave a computer to", "patch_prefix": "Then, James and Sara went to the hospital. Adam gave a computer to", "clean_answer": " Jonathan", "patch_answer": " Kenneth", "case": "BABA_16"}
{"clean_prefix": "Then, Michelle and Crystal went to the store. Michelle gave a bone to", "patch_prefix": "Then, Lauren and Richard went to the store. Joseph gave a bone to", "clean_answer": " Crystal", "patch_answer": " Michelle", "case": "BABA_16"}
{"clean_prefix": "Then, Mark and Benjamin went to the house. Mark gave a drink to", "patch_prefix": "Then, Joseph and Rachel went to the house. Courtney gave a drink to", "clean_answer": " Benjamin", "patch_answer": " Mark", "case": "BABA_16"}
{"clean_prefix": "Then, Stephen and Steven went to the store. Stephen gave a kiss to", "patch_prefix": "Then, Tiffany and Nicole went to the store. Kimberly gave a kiss to", "clean_answer": " Steven", "patch_answer": " Stephen", "case": "BABA_16"}
{"clean_prefix": "Then, Mary and Sarah went to the school. Mary gave a bone to", "patch_prefix": "Then, Samantha and Alexander went to the school. Andrew gave a bone to", "clean_answer": " Sarah", "patch_answer": " Mary", "case": "BABA_16"}
{"clean_prefix": "Then, David and Kenneth went to the restaurant. David gave a basketball to", "patch_prefix": "Then, Kristen and Shannon went to the restaurant. Richard gave a basketball to", "clean_answer": " Kenneth", "patch_answer": " David", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Jason went to the store. Christopher gave a snack to", "patch_prefix": "Then, Amanda and Daniel went to the store. Bradley gave a snack to", "clean_answer": " Jason", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Lindsey went to the house. Christopher gave a necklace to", "patch_prefix": "Then, Jose and Alexander went to the house. Erin gave a necklace to", "clean_answer": " Lindsey", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Matthew and Laura went to the station. Matthew gave a basketball to", "patch_prefix": "Then, Christina and Bryan went to the station. Justin gave a basketball to", "clean_answer": " Laura", "patch_answer": " Matthew", "case": "BABA_16"}
{"clean_prefix": "Then, Lisa and Heather went to the garden. Lisa gave a basketball to", "patch_prefix": "Then, Lindsey and Sean went to the garden. Rebecca gave a basketball to", "clean_answer": " Heather", "patch_answer": " Lisa", "case": "BABA_16"}
{"clean_prefix": "Then, Vanessa and Ashley went to the restaurant. Vanessa gave a bone to", "patch_prefix": "Then, Michael and Rebecca went to the restaurant. Elizabeth gave a bone to", "clean_answer": " Ashley", "patch_answer": " Vanessa", "case": "BABA_16"}
{"clean_prefix": "Then, Elizabeth and Joshua went to the office. Elizabeth gave a computer to", "patch_prefix": "Then, Jose and Amber went to the office. Erica gave a computer to", "clean_answer": " Joshua", "patch_answer": " Elizabeth", "case": "BABA_16"}
{"clean_prefix": "Then, Jonathan and Sarah went to the house. Jonathan gave a basketball to", "patch_prefix": "Then, Kimberly and Nicholas went to the house. Stephen gave a basketball to", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"}
{"clean_prefix": "Then, Daniel and Samantha went to the house. Daniel gave a kiss to", "patch_prefix": "Then, Courtney and Lindsey went to the house. Elizabeth gave a kiss to", "clean_answer": " Samantha", "patch_answer": " Daniel", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Amy went to the house. Alicia gave a ring to", "patch_prefix": "Then, Charles and Richard went to the house. Nicole gave a ring to", "clean_answer": " Amy", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Aaron went to the house. Alicia gave a bone to", "patch_prefix": "Then, Tiffany and Lindsey went to the house. Ryan gave a bone to", "clean_answer": " Aaron", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Nicholas and Courtney went to the school. Nicholas gave a computer to", "patch_prefix": "Then, Patrick and Christina went to the school. Mark gave a computer to", "clean_answer": " Courtney", "patch_answer": " Nicholas", "case": "BABA_16"}
{"clean_prefix": "Then, Kimberly and Kelly went to the hospital. Kimberly gave a drink to", "patch_prefix": "Then, Dustin and Kevin went to the hospital. Melissa gave a drink to", "clean_answer": " Kelly", "patch_answer": " Kimberly", "case": "BABA_16"}
{"clean_prefix": "Then, Nicole and Ashley went to the hospital. Nicole gave a basketball to", "patch_prefix": "Then, Rebecca and Stephen went to the hospital. Lisa gave a basketball to", "clean_answer": " Ashley", "patch_answer": " Nicole", "case": "BABA_16"}
{"clean_prefix": "Then, Jonathan and Katie went to the garden. Jonathan gave a necklace to", "patch_prefix": "Then, Cody and Amanda went to the garden. Ryan gave a necklace to", "clean_answer": " Katie", "patch_answer": " Jonathan", "case": "BABA_16"}
{"clean_prefix": "Then, Robert and Courtney went to the school. Robert gave a ring to", "patch_prefix": "Then, Scott and Christina went to the school. Jonathan gave a ring to", "clean_answer": " Courtney", "patch_answer": " Robert", "case": "BABA_16"}
{"clean_prefix": "Then, Sean and Ashley went to the school. Sean gave a computer to", "patch_prefix": "Then, Amanda and Samuel went to the school. Kenneth gave a computer to", "clean_answer": " Ashley", "patch_answer": " Sean", "case": "BABA_16"}
{"clean_prefix": "Then, Charles and Brian went to the store. Charles gave a kiss to", "patch_prefix": "Then, Jeffrey and Brandon went to the store. Courtney gave a kiss to", "clean_answer": " Brian", "patch_answer": " Charles", "case": "BABA_16"}
{"clean_prefix": "Then, Allison and Lisa went to the restaurant. Allison gave a computer to", "patch_prefix": "Then, Dustin and Richard went to the restaurant. Vanessa gave a computer to", "clean_answer": " Lisa", "patch_answer": " Allison", "case": "BABA_16"}
{"clean_prefix": "Then, Michael and Samuel went to the house. Michael gave a basketball to", "patch_prefix": "Then, Matthew and Scott went to the house. Lauren gave a basketball to", "clean_answer": " Samuel", "patch_answer": " Michael", "case": "BABA_16"}
{"clean_prefix": "Then, Michael and Sarah went to the station. Michael gave a kiss to", "patch_prefix": "Then, Thomas and Sara went to the station. Jeremy gave a kiss to", "clean_answer": " Sarah", "patch_answer": " Michael", "case": "BABA_16"}
{"clean_prefix": "Then, Melissa and William went to the hospital. Melissa gave a drink to", "patch_prefix": "Then, Heather and Bradley went to the hospital. Michelle gave a drink to", "clean_answer": " William", "patch_answer": " Melissa", "case": "BABA_16"}
{"clean_prefix": "Then, Erin and Lindsey went to the station. Erin gave a computer to", "patch_prefix": "Then, Mark and Stephen went to the station. Brandon gave a computer to", "clean_answer": " Lindsey", "patch_answer": " Erin", "case": "BABA_16"}
{"clean_prefix": "Then, Bryan and Melissa went to the school. Bryan gave a bone to", "patch_prefix": "Then, Angela and Katherine went to the school. Mark gave a bone to", "clean_answer": " Melissa", "patch_answer": " Bryan", "case": "BABA_16"}
{"clean_prefix": "Then, Samuel and Mark went to the garden. Samuel gave a ring to", "patch_prefix": "Then, Steven and Matthew went to the garden. Charles gave a ring to", "clean_answer": " Mark", "patch_answer": " Samuel", "case": "BABA_16"}
{"clean_prefix": "Then, Stephen and Stephanie went to the store. Stephen gave a kiss to", "patch_prefix": "Then, Katherine and Jonathan went to the store. Gregory gave a kiss to", "clean_answer": " Stephanie", "patch_answer": " Stephen", "case": "BABA_16"}
{"clean_prefix": "Then, Justin and Melissa went to the restaurant. Justin gave a basketball to", "patch_prefix": "Then, Dustin and Joshua went to the restaurant. Joseph gave a basketball to", "clean_answer": " Melissa", "patch_answer": " Justin", "case": "BABA_16"}
{"clean_prefix": "Then, Eric and Bryan went to the store. Eric gave a ring to", "patch_prefix": "Then, Courtney and Kristen went to the store. Tyler gave a ring to", "clean_answer": " Bryan", "patch_answer": " Eric", "case": "BABA_16"}
{"clean_prefix": "Then, Kenneth and Amanda went to the house. Kenneth gave a computer to", "patch_prefix": "Then, Melissa and Heather went to the house. Jason gave a computer to", "clean_answer": " Amanda", "patch_answer": " Kenneth", "case": "BABA_16"}
{"clean_prefix": "Then, Kevin and Erin went to the restaurant. Kevin gave a kiss to", "patch_prefix": "Then, Lindsey and Anthony went to the restaurant. Amber gave a kiss to", "clean_answer": " Erin", "patch_answer": " Kevin", "case": "BABA_16"}
{"clean_prefix": "Then, Timothy and John went to the house. Timothy gave a computer to", "patch_prefix": "Then, Cody and Matthew went to the house. Andrea gave a computer to", "clean_answer": " John", "patch_answer": " Timothy", "case": "BABA_16"}
{"clean_prefix": "Then, Jeffrey and Andrew went to the garden. Jeffrey gave a bone to", "patch_prefix": "Then, Jeffrey and Benjamin went to the garden. Jesse gave a bone to", "clean_answer": " Andrew", "patch_answer": " Jeffrey", "case": "BABA_16"}
{"clean_prefix": "Then, Angela and Jeremy went to the hospital. Angela gave a necklace to", "patch_prefix": "Then, Christopher and Christina went to the hospital. Paul gave a necklace to", "clean_answer": " Jeremy", "patch_answer": " Angela", "case": "BABA_16"}
{"clean_prefix": "Then, Jessica and Allison went to the store. Jessica gave a ring to", "patch_prefix": "Then, Melissa and Amanda went to the store. Mary gave a ring to", "clean_answer": " Allison", "patch_answer": " Jessica", "case": "BABA_16"}
{"clean_prefix": "Then, Andrew and Lauren went to the garden. Andrew gave a computer to", "patch_prefix": "Then, Erin and Lisa went to the garden. Kimberly gave a computer to", "clean_answer": " Lauren", "patch_answer": " Andrew", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and Kevin went to the garden. Steven gave a bone to", "patch_prefix": "Then, Emily and Robert went to the garden. Michelle gave a bone to", "clean_answer": " Kevin", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, Kimberly and Jeffrey went to the office. Kimberly gave a ring to", "patch_prefix": "Then, Jamie and Jessica went to the office. Brittany gave a ring to", "clean_answer": " Jeffrey", "patch_answer": " Kimberly", "case": "BABA_16"}
{"clean_prefix": "Then, Christina and Jeremy went to the hospital. Christina gave a ring to", "patch_prefix": "Then, Jose and Mark went to the hospital. Kelly gave a ring to", "clean_answer": " Jeremy", "patch_answer": " Christina", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Sean went to the school. Amber gave a kiss to", "patch_prefix": "Then, Stephanie and Jennifer went to the school. Mary gave a kiss to", "clean_answer": " Sean", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Travis and Kenneth went to the garden. Travis gave a computer to", "patch_prefix": "Then, Jennifer and Mary went to the garden. Jeffrey gave a computer to", "clean_answer": " Kenneth", "patch_answer": " Travis", "case": "BABA_16"}
{"clean_prefix": "Then, Jamie and Jacob went to the station. Jamie gave a basketball to", "patch_prefix": "Then, Thomas and Mary went to the station. David gave a basketball to", "clean_answer": " Jacob", "patch_answer": " Jamie", "case": "BABA_16"}
{"clean_prefix": "Then, Crystal and Laura went to the office. Crystal gave a basketball to", "patch_prefix": "Then, Eric and Adam went to the office. David gave a basketball to", "clean_answer": " Laura", "patch_answer": " Crystal", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Jeffrey went to the hospital. Amy gave a basketball to", "patch_prefix": "Then, Vanessa and Samuel went to the hospital. Steven gave a basketball to", "clean_answer": " Jeffrey", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Daniel went to the restaurant. Amy gave a basketball to", "patch_prefix": "Then, David and Matthew went to the restaurant. Alicia gave a basketball to", "clean_answer": " Daniel", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Amy and Brittany went to the garden. Amy gave a kiss to", "patch_prefix": "Then, Brittany and Michael went to the garden. Christopher gave a kiss to", "clean_answer": " Brittany", "patch_answer": " Amy", "case": "BABA_16"}
{"clean_prefix": "Then, Sarah and Kimberly went to the office. Sarah gave a snack to", "patch_prefix": "Then, Matthew and Christine went to the office. Kyle gave a snack to", "clean_answer": " Kimberly", "patch_answer": " Sarah", "case": "BABA_16"}
{"clean_prefix": "Then, Dustin and Jeremy went to the office. Dustin gave a necklace to", "patch_prefix": "Then, Alexander and Patrick went to the office. Alicia gave a necklace to", "clean_answer": " Jeremy", "patch_answer": " Dustin", "case": "BABA_16"}
{"clean_prefix": "Then, Shannon and Matthew went to the office. Shannon gave a necklace to", "patch_prefix": "Then, Ashley and Michael went to the office. Michelle gave a necklace to", "clean_answer": " Matthew", "patch_answer": " Shannon", "case": "BABA_16"}
{"clean_prefix": "Then, Vanessa and Ryan went to the office. Vanessa gave a ring to", "patch_prefix": "Then, Elizabeth and Jason went to the office. Joseph gave a ring to", "clean_answer": " Ryan", "patch_answer": " Vanessa", "case": "BABA_16"}
{"clean_prefix": "Then, Aaron and Lindsay went to the school. Aaron gave a ring to", "patch_prefix": "Then, Stephen and Elizabeth went to the school. Alexander gave a ring to", "clean_answer": " Lindsay", "patch_answer": " Aaron", "case": "BABA_16"}
{"clean_prefix": "Then, Gregory and Bryan went to the office. Gregory gave a necklace to", "patch_prefix": "Then, Jessica and Steven went to the office. Jesse gave a necklace to", "clean_answer": " Bryan", "patch_answer": " Gregory", "case": "BABA_16"}
{"clean_prefix": "Then, Katie and Kyle went to the store. Katie gave a necklace to", "patch_prefix": "Then, Alicia and Jacob went to the store. Christina gave a necklace to", "clean_answer": " Kyle", "patch_answer": " Katie", "case": "BABA_16"}
{"clean_prefix": "Then, Jonathan and Danielle went to the garden. Jonathan gave a drink to", "patch_prefix": "Then, Dustin and Erin went to the garden. Christine gave a drink to", "clean_answer": " Danielle", "patch_answer": " Jonathan", "case": "BABA_16"}
{"clean_prefix": "Then, Rebecca and Kristen went to the office. Rebecca gave a ring to", "patch_prefix": "Then, Jeffrey and Alicia went to the office. Shannon gave a ring to", "clean_answer": " Kristen", "patch_answer": " Rebecca", "case": "BABA_16"}
{"clean_prefix": "Then, Amanda and Nathan went to the garden. Amanda gave a drink to", "patch_prefix": "Then, Jason and Kyle went to the garden. Alexander gave a drink to", "clean_answer": " Nathan", "patch_answer": " Amanda", "case": "BABA_16"}
{"clean_prefix": "Then, Brandon and Jeremy went to the hospital. Brandon gave a drink to", "patch_prefix": "Then, Travis and Travis went to the hospital. Joshua gave a drink to", "clean_answer": " Jeremy", "patch_answer": " Brandon", "case": "BABA_16"}
{"clean_prefix": "Then, Ashley and Sara went to the school. Ashley gave a bone to", "patch_prefix": "Then, Aaron and Christopher went to the school. Katherine gave a bone to", "clean_answer": " Sara", "patch_answer": " Ashley", "case": "BABA_16"}
{"clean_prefix": "Then, Stephanie and Jacob went to the school. Stephanie gave a ring to", "patch_prefix": "Then, Lauren and Ryan went to the school. Brittany gave a ring to", "clean_answer": " Jacob", "patch_answer": " Stephanie", "case": "BABA_16"}
{"clean_prefix": "Then, Stephen and Kelly went to the house. Stephen gave a computer to", "patch_prefix": "Then, Nicole and Alexander went to the house. Christopher gave a computer to", "clean_answer": " Kelly", "patch_answer": " Stephen", "case": "BABA_16"}
{"clean_prefix": "Then, Sean and Charles went to the hospital. Sean gave a drink to", "patch_prefix": "Then, Matthew and Benjamin went to the hospital. Shannon gave a drink to", "clean_answer": " Charles", "patch_answer": " Sean", "case": "BABA_16"}
{"clean_prefix": "Then, Jennifer and Bradley went to the office. Jennifer gave a drink to", "patch_prefix": "Then, Stephen and Stephanie went to the office. Amy gave a drink to", "clean_answer": " Bradley", "patch_answer": " Jennifer", "case": "BABA_16"}
{"clean_prefix": "Then, Mary and Daniel went to the house. Mary gave a bone to", "patch_prefix": "Then, Tiffany and David went to the house. Sarah gave a bone to", "clean_answer": " Daniel", "patch_answer": " Mary", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Laura went to the house. Christopher gave a basketball to", "patch_prefix": "Then, Sean and Jeffrey went to the house. David gave a basketball to", "clean_answer": " Laura", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Anthony and Jessica went to the hospital. Anthony gave a kiss to", "patch_prefix": "Then, Sean and James went to the hospital. Benjamin gave a kiss to", "clean_answer": " Jessica", "patch_answer": " Anthony", "case": "BABA_16"}
{"clean_prefix": "Then, James and Kyle went to the restaurant. James gave a basketball to", "patch_prefix": "Then, Matthew and Joshua went to the restaurant. Paul gave a basketball to", "clean_answer": " Kyle", "patch_answer": " James", "case": "BABA_16"}
{"clean_prefix": "Then, Aaron and Rachel went to the hospital. Aaron gave a basketball to", "patch_prefix": "Then, Lauren and Daniel went to the hospital. Brittany gave a basketball to", "clean_answer": " Rachel", "patch_answer": " Aaron", "case": "BABA_16"}
{"clean_prefix": "Then, Jesse and Lisa went to the hospital. Jesse gave a bone to", "patch_prefix": "Then, Mark and Tyler went to the hospital. Jennifer gave a bone to", "clean_answer": " Lisa", "patch_answer": " Jesse", "case": "BABA_16"}
{"clean_prefix": "Then, Tiffany and Lauren went to the hospital. Tiffany gave a necklace to", "patch_prefix": "Then, Nicholas and Justin went to the hospital. Laura gave a necklace to", "clean_answer": " Lauren", "patch_answer": " Tiffany", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Lisa went to the station. Joshua gave a necklace to", "patch_prefix": "Then, Erin and Christine went to the station. Jose gave a necklace to", "clean_answer": " Lisa", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Stephen and Andrea went to the house. Stephen gave a basketball to", "patch_prefix": "Then, Amanda and Robert went to the house. Joshua gave a basketball to", "clean_answer": " Andrea", "patch_answer": " Stephen", "case": "BABA_16"}
{"clean_prefix": "Then, Kelly and Rachel went to the school. Kelly gave a basketball to", "patch_prefix": "Then, Brittany and Crystal went to the school. Katie gave a basketball to", "clean_answer": " Rachel", "patch_answer": " Kelly", "case": "BABA_16"}
{"clean_prefix": "Then, Tiffany and Jamie went to the store. Tiffany gave a computer to", "patch_prefix": "Then, Brian and Tyler went to the store. Matthew gave a computer to", "clean_answer": " Jamie", "patch_answer": " Tiffany", "case": "BABA_16"}
{"clean_prefix": "Then, Nicholas and Megan went to the school. Nicholas gave a basketball to", "patch_prefix": "Then, Tiffany and Robert went to the school. Heather gave a basketball to", "clean_answer": " Megan", "patch_answer": " Nicholas", "case": "BABA_16"}
{"clean_prefix": "Then, Nicole and Crystal went to the school. Nicole gave a basketball to", "patch_prefix": "Then, Aaron and Michelle went to the school. Steven gave a basketball to", "clean_answer": " Crystal", "patch_answer": " Nicole", "case": "BABA_16"}
{"clean_prefix": "Then, Vanessa and Samuel went to the school. Vanessa gave a ring to", "patch_prefix": "Then, Kevin and Charles went to the school. Joseph gave a ring to", "clean_answer": " Samuel", "patch_answer": " Vanessa", "case": "BABA_16"}
{"clean_prefix": "Then, Robert and Danielle went to the hospital. Robert gave a computer to", "patch_prefix": "Then, Amy and Matthew went to the hospital. Jason gave a computer to", "clean_answer": " Danielle", "patch_answer": " Robert", "case": "BABA_16"}
{"clean_prefix": "Then, Robert and Sarah went to the store. Robert gave a basketball to", "patch_prefix": "Then, Christopher and Elizabeth went to the store. Amber gave a basketball to", "clean_answer": " Sarah", "patch_answer": " Robert", "case": "BABA_16"}
{"clean_prefix": "Then, Benjamin and Brittany went to the hospital. Benjamin gave a basketball to", "patch_prefix": "Then, Ryan and Andrea went to the hospital. Ryan gave a basketball to", "clean_answer": " Brittany", "patch_answer": " Benjamin", "case": "BABA_16"}
{"clean_prefix": "Then, David and Andrea went to the school. David gave a bone to", "patch_prefix": "Then, Erin and Bradley went to the school. Jeremy gave a bone to", "clean_answer": " Andrea", "patch_answer": " David", "case": "BABA_16"}
{"clean_prefix": "Then, Erica and Scott went to the station. Erica gave a computer to", "patch_prefix": "Then, Nicholas and Adam went to the station. Danielle gave a computer to", "clean_answer": " Scott", "patch_answer": " Erica", "case": "BABA_16"}
{"clean_prefix": "Then, Sara and Brittany went to the garden. Sara gave a computer to", "patch_prefix": "Then, Michael and Rebecca went to the garden. Kenneth gave a computer to", "clean_answer": " Brittany", "patch_answer": " Sara", "case": "BABA_16"}
{"clean_prefix": "Then, Jeffrey and Mary went to the restaurant. Jeffrey gave a computer to", "patch_prefix": "Then, Crystal and Sara went to the restaurant. Jennifer gave a computer to", "clean_answer": " Mary", "patch_answer": " Jeffrey", "case": "BABA_16"}
{"clean_prefix": "Then, Patrick and Brittany went to the house. Patrick gave a necklace to", "patch_prefix": "Then, Rachel and Jacob went to the house. Lindsey gave a necklace to", "clean_answer": " Brittany", "patch_answer": " Patrick", "case": "BABA_16"}
{"clean_prefix": "Then, Brittany and Jeffrey went to the station. Brittany gave a basketball to", "patch_prefix": "Then, Jessica and Melissa went to the station. Angela gave a basketball to", "clean_answer": " Jeffrey", "patch_answer": " Brittany", "case": "BABA_16"}
{"clean_prefix": "Then, Erin and Jennifer went to the restaurant. Erin gave a kiss to", "patch_prefix": "Then, Adam and Stephen went to the restaurant. Christine gave a kiss to", "clean_answer": " Jennifer", "patch_answer": " Erin", "case": "BABA_16"}
{"clean_prefix": "Then, Heather and Samantha went to the garden. Heather gave a kiss to", "patch_prefix": "Then, Joseph and Richard went to the garden. Vanessa gave a kiss to", "clean_answer": " Samantha", "patch_answer": " Heather", "case": "BABA_16"}
{"clean_prefix": "Then, Benjamin and Ryan went to the school. Benjamin gave a snack to", "patch_prefix": "Then, Andrea and Heather went to the school. Lauren gave a snack to", "clean_answer": " Ryan", "patch_answer": " Benjamin", "case": "BABA_16"}
{"clean_prefix": "Then, Vanessa and Angela went to the garden. Vanessa gave a ring to", "patch_prefix": "Then, Robert and Heather went to the garden. Bryan gave a ring to", "clean_answer": " Angela", "patch_answer": " Vanessa", "case": "BABA_16"}
{"clean_prefix": "Then, Rebecca and Melissa went to the restaurant. Rebecca gave a computer to", "patch_prefix": "Then, Jennifer and Elizabeth went to the restaurant. Elizabeth gave a computer to", "clean_answer": " Melissa", "patch_answer": " Rebecca", "case": "BABA_16"}
{"clean_prefix": "Then, David and Rachel went to the school. David gave a ring to", "patch_prefix": "Then, Joshua and Lindsay went to the school. Kevin gave a ring to", "clean_answer": " Rachel", "patch_answer": " David", "case": "BABA_16"}
{"clean_prefix": "Then, Kimberly and Michelle went to the school. Kimberly gave a basketball to", "patch_prefix": "Then, Rachel and Stephanie went to the school. Angela gave a basketball to", "clean_answer": " Michelle", "patch_answer": " Kimberly", "case": "BABA_16"}
{"clean_prefix": "Then, Jessica and Laura went to the garden. Jessica gave a ring to", "patch_prefix": "Then, Christina and Andrea went to the garden. Alicia gave a ring to", "clean_answer": " Laura", "patch_answer": " Jessica", "case": "BABA_16"}
{"clean_prefix": "Then, Richard and Eric went to the garden. Richard gave a drink to", "patch_prefix": "Then, Joshua and Thomas went to the garden. Lisa gave a drink to", "clean_answer": " Eric", "patch_answer": " Richard", "case": "BABA_16"}
{"clean_prefix": "Then, Brandon and Eric went to the school. Brandon gave a snack to", "patch_prefix": "Then, Jeremy and Erin went to the school. Stephanie gave a snack to", "clean_answer": " Eric", "patch_answer": " Brandon", "case": "BABA_16"}
{"clean_prefix": "Then, Lauren and Matthew went to the garden. Lauren gave a drink to", "patch_prefix": "Then, Michelle and Scott went to the garden. Ashley gave a drink to", "clean_answer": " Matthew", "patch_answer": " Lauren", "case": "BABA_16"}
{"clean_prefix": "Then, James and Sarah went to the hospital. James gave a computer to", "patch_prefix": "Then, Amy and Angela went to the hospital. Michael gave a computer to", "clean_answer": " Sarah", "patch_answer": " James", "case": "BABA_16"}
{"clean_prefix": "Then, James and Daniel went to the store. James gave a necklace to", "patch_prefix": "Then, Stephanie and Aaron went to the store. Dustin gave a necklace to", "clean_answer": " Daniel", "patch_answer": " James", "case": "BABA_16"}
{"clean_prefix": "Then, Samuel and Steven went to the school. Samuel gave a computer to", "patch_prefix": "Then, Jose and Jeffrey went to the school. Kelly gave a computer to", "clean_answer": " Steven", "patch_answer": " Samuel", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Gregory went to the house. Christopher gave a computer to", "patch_prefix": "Then, Jeremy and Amy went to the house. James gave a computer to", "clean_answer": " Gregory", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Jennifer and Jessica went to the restaurant. Jennifer gave a snack to", "patch_prefix": "Then, Amanda and Angela went to the restaurant. Paul gave a snack to", "clean_answer": " Jessica", "patch_answer": " Jennifer", "case": "BABA_16"}
{"clean_prefix": "Then, Mary and Eric went to the office. Mary gave a computer to", "patch_prefix": "Then, Timothy and Nathan went to the office. Brandon gave a computer to", "clean_answer": " Eric", "patch_answer": " Mary", "case": "BABA_16"}
{"clean_prefix": "Then, Kevin and Steven went to the office. Kevin gave a computer to", "patch_prefix": "Then, Paul and Sean went to the office. Heather gave a computer to", "clean_answer": " Steven", "patch_answer": " Kevin", "case": "BABA_16"}
{"clean_prefix": "Then, Stephanie and Lindsey went to the school. Stephanie gave a computer to", "patch_prefix": "Then, Ashley and Jennifer went to the school. Lauren gave a computer to", "clean_answer": " Lindsey", "patch_answer": " Stephanie", "case": "BABA_16"}
{"clean_prefix": "Then, Aaron and Dustin went to the garden. Aaron gave a basketball to", "patch_prefix": "Then, Samuel and Emily went to the garden. Paul gave a basketball to", "clean_answer": " Dustin", "patch_answer": " Aaron", "case": "BABA_16"}
{"clean_prefix": "Then, Alexander and David went to the school. Alexander gave a drink to", "patch_prefix": "Then, Andrew and Kimberly went to the school. Steven gave a drink to", "clean_answer": " David", "patch_answer": " Alexander", "case": "BABA_16"}
{"clean_prefix": "Then, Crystal and Andrea went to the restaurant. Crystal gave a drink to", "patch_prefix": "Then, Kristen and Sean went to the restaurant. Timothy gave a drink to", "clean_answer": " Andrea", "patch_answer": " Crystal", "case": "BABA_16"}
{"clean_prefix": "Then, Ashley and Elizabeth went to the station. Ashley gave a snack to", "patch_prefix": "Then, Jeremy and Brandon went to the station. Samuel gave a snack to", "clean_answer": " Elizabeth", "patch_answer": " Ashley", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Jesse went to the restaurant. Amber gave a computer to", "patch_prefix": "Then, Andrea and Patrick went to the restaurant. Jacob gave a computer to", "clean_answer": " Jesse", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Nathan and Nicholas went to the hospital. Nathan gave a basketball to", "patch_prefix": "Then, Benjamin and Samantha went to the hospital. Lindsay gave a basketball to", "clean_answer": " Nicholas", "patch_answer": " Nathan", "case": "BABA_16"}
{"clean_prefix": "Then, Andrew and Rebecca went to the station. Andrew gave a necklace to", "patch_prefix": "Then, Christine and Robert went to the station. Heather gave a necklace to", "clean_answer": " Rebecca", "patch_answer": " Andrew", "case": "BABA_16"}
{"clean_prefix": "Then, Jamie and Rachel went to the store. Jamie gave a basketball to", "patch_prefix": "Then, Nathan and Megan went to the store. Aaron gave a basketball to", "clean_answer": " Rachel", "patch_answer": " Jamie", "case": "BABA_16"}
{"clean_prefix": "Then, Sara and Kimberly went to the office. Sara gave a necklace to", "patch_prefix": "Then, Danielle and James went to the office. Rebecca gave a necklace to", "clean_answer": " Kimberly", "patch_answer": " Sara", "case": "BABA_16"}
{"clean_prefix": "Then, Nicole and Rachel went to the store. Nicole gave a drink to", "patch_prefix": "Then, Shannon and William went to the store. Megan gave a drink to", "clean_answer": " Rachel", "patch_answer": " Nicole", "case": "BABA_16"}
{"clean_prefix": "Then, Brandon and Katherine went to the store. Brandon gave a bone to", "patch_prefix": "Then, Jessica and Jeremy went to the store. Matthew gave a bone to", "clean_answer": " Katherine", "patch_answer": " Brandon", "case": "BABA_16"}
{"clean_prefix": "Then, Eric and Anthony went to the restaurant. Eric gave a computer to", "patch_prefix": "Then, Brian and Jennifer went to the restaurant. Rachel gave a computer to", "clean_answer": " Anthony", "patch_answer": " Eric", "case": "BABA_16"}
{"clean_prefix": "Then, Jacob and Jason went to the restaurant. Jacob gave a basketball to", "patch_prefix": "Then, Benjamin and Travis went to the restaurant. Kristen gave a basketball to", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"}
{"clean_prefix": "Then, Patrick and Kristen went to the store. Patrick gave a drink to", "patch_prefix": "Then, Sara and Vanessa went to the store. Jeffrey gave a drink to", "clean_answer": " Kristen", "patch_answer": " Patrick", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Matthew went to the hospital. Christopher gave a bone to", "patch_prefix": "Then, Timothy and Joshua went to the hospital. Charles gave a bone to", "clean_answer": " Matthew", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Steven and Ashley went to the store. Steven gave a computer to", "patch_prefix": "Then, Kenneth and Scott went to the store. Jonathan gave a computer to", "clean_answer": " Ashley", "patch_answer": " Steven", "case": "BABA_16"}
{"clean_prefix": "Then, Erica and Jonathan went to the house. Erica gave a necklace to", "patch_prefix": "Then, Lindsay and Andrea went to the house. Jason gave a necklace to", "clean_answer": " Jonathan", "patch_answer": " Erica", "case": "BABA_16"}
{"clean_prefix": "Then, Sean and Dustin went to the restaurant. Sean gave a drink to", "patch_prefix": "Then, Timothy and Thomas went to the restaurant. Michael gave a drink to", "clean_answer": " Dustin", "patch_answer": " Sean", "case": "BABA_16"}
{"clean_prefix": "Then, Samantha and Ryan went to the station. Samantha gave a drink to", "patch_prefix": "Then, Joshua and Dustin went to the station. Joseph gave a drink to", "clean_answer": " Ryan", "patch_answer": " Samantha", "case": "BABA_16"}
{"clean_prefix": "Then, Danielle and Brittany went to the hospital. Danielle gave a necklace to", "patch_prefix": "Then, Michelle and Justin went to the hospital. Bryan gave a necklace to", "clean_answer": " Brittany", "patch_answer": " Danielle", "case": "BABA_16"}
{"clean_prefix": "Then, Ryan and Cody went to the store. Ryan gave a bone to", "patch_prefix": "Then, Eric and Kristen went to the store. Daniel gave a bone to", "clean_answer": " Cody", "patch_answer": " Ryan", "case": "BABA_16"}
{"clean_prefix": "Then, Lindsay and Steven went to the house. Lindsay gave a necklace to", "patch_prefix": "Then, Lindsay and Jonathan went to the house. Christina gave a necklace to", "clean_answer": " Steven", "patch_answer": " Lindsay", "case": "BABA_16"}
{"clean_prefix": "Then, David and James went to the office. David gave a bone to", "patch_prefix": "Then, Kyle and Mary went to the office. Thomas gave a bone to", "clean_answer": " James", "patch_answer": " David", "case": "BABA_16"}
{"clean_prefix": "Then, Andrea and Kyle went to the school. Andrea gave a necklace to", "patch_prefix": "Then, Elizabeth and Joseph went to the school. Laura gave a necklace to", "clean_answer": " Kyle", "patch_answer": " Andrea", "case": "BABA_16"}
{"clean_prefix": "Then, Jason and Anthony went to the station. Jason gave a drink to", "patch_prefix": "Then, Jessica and Nathan went to the station. Anthony gave a drink to", "clean_answer": " Anthony", "patch_answer": " Jason", "case": "BABA_16"}
{"clean_prefix": "Then, Kevin and James went to the house. Kevin gave a necklace to", "patch_prefix": "Then, Lindsey and Jason went to the house. Alicia gave a necklace to", "clean_answer": " James", "patch_answer": " Kevin", "case": "BABA_16"}
{"clean_prefix": "Then, Bryan and Bradley went to the restaurant. Bryan gave a necklace to", "patch_prefix": "Then, Justin and Anthony went to the restaurant. Charles gave a necklace to", "clean_answer": " Bradley", "patch_answer": " Bryan", "case": "BABA_16"}
{"clean_prefix": "Then, Elizabeth and Brandon went to the restaurant. Elizabeth gave a snack to", "patch_prefix": "Then, Jamie and Erin went to the restaurant. Richard gave a snack to", "clean_answer": " Brandon", "patch_answer": " Elizabeth", "case": "BABA_16"}
{"clean_prefix": "Then, Jessica and Jennifer went to the house. Jessica gave a bone to", "patch_prefix": "Then, Jason and Joseph went to the house. Brian gave a bone to", "clean_answer": " Jennifer", "patch_answer": " Jessica", "case": "BABA_16"}
{"clean_prefix": "Then, Bryan and Elizabeth went to the house. Bryan gave a bone to", "patch_prefix": "Then, Amber and Richard went to the house. Tyler gave a bone to", "clean_answer": " Elizabeth", "patch_answer": " Bryan", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Jose went to the school. Joshua gave a kiss to", "patch_prefix": "Then, Ashley and Amy went to the school. Lisa gave a kiss to", "clean_answer": " Jose", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Katherine and Adam went to the garden. Katherine gave a ring to", "patch_prefix": "Then, Ashley and Aaron went to the garden. Justin gave a ring to", "clean_answer": " Adam", "patch_answer": " Katherine", "case": "BABA_16"}
{"clean_prefix": "Then, Sarah and Megan went to the office. Sarah gave a drink to", "patch_prefix": "Then, Justin and Rebecca went to the office. Katherine gave a drink to", "clean_answer": " Megan", "patch_answer": " Sarah", "case": "BABA_16"}
{"clean_prefix": "Then, Kyle and Christina went to the store. Kyle gave a bone to", "patch_prefix": "Then, James and Cody went to the store. Jamie gave a bone to", "clean_answer": " Christina", "patch_answer": " Kyle", "case": "BABA_16"}
{"clean_prefix": "Then, Richard and Jeffrey went to the restaurant. Richard gave a snack to", "patch_prefix": "Then, Michelle and Lindsay went to the restaurant. Matthew gave a snack to", "clean_answer": " Jeffrey", "patch_answer": " Richard", "case": "BABA_16"}
{"clean_prefix": "Then, William and Benjamin went to the station. William gave a bone to", "patch_prefix": "Then, Lindsey and Erica went to the station. William gave a bone to", "clean_answer": " Benjamin", "patch_answer": " William", "case": "BABA_16"}
{"clean_prefix": "Then, John and Vanessa went to the station. John gave a bone to", "patch_prefix": "Then, Steven and Amanda went to the station. Jeffrey gave a bone to", "clean_answer": " Vanessa", "patch_answer": " John", "case": "BABA_16"}
{"clean_prefix": "Then, Scott and Amber went to the garden. Scott gave a computer to", "patch_prefix": "Then, Matthew and Anthony went to the garden. Sean gave a computer to", "clean_answer": " Amber", "patch_answer": " Scott", "case": "BABA_16"}
{"clean_prefix": "Then, Amber and Kevin went to the garden. Amber gave a drink to", "patch_prefix": "Then, Daniel and Jason went to the garden. Bradley gave a drink to", "clean_answer": " Kevin", "patch_answer": " Amber", "case": "BABA_16"}
{"clean_prefix": "Then, Timothy and Christine went to the hospital. Timothy gave a drink to", "patch_prefix": "Then, Shannon and Sara went to the hospital. Nicole gave a drink to", "clean_answer": " Christine", "patch_answer": " Timothy", "case": "BABA_16"}
{"clean_prefix": "Then, Alexander and Anthony went to the school. Alexander gave a necklace to", "patch_prefix": "Then, Thomas and Tyler went to the school. Angela gave a necklace to", "clean_answer": " Anthony", "patch_answer": " Alexander", "case": "BABA_16"}
{"clean_prefix": "Then, Heather and Rachel went to the house. Heather gave a drink to", "patch_prefix": "Then, Travis and Rebecca went to the house. Courtney gave a drink to", "clean_answer": " Rachel", "patch_answer": " Heather", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Amber went to the garden. Joshua gave a kiss to", "patch_prefix": "Then, Richard and Amanda went to the garden. Sarah gave a kiss to", "clean_answer": " Amber", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Courtney went to the restaurant. Joshua gave a drink to", "patch_prefix": "Then, Nathan and Benjamin went to the restaurant. Alexander gave a drink to", "clean_answer": " Courtney", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Christopher and Jonathan went to the station. Christopher gave a computer to", "patch_prefix": "Then, Matthew and Andrea went to the station. Mary gave a computer to", "clean_answer": " Jonathan", "patch_answer": " Christopher", "case": "BABA_16"}
{"clean_prefix": "Then, Ryan and Jonathan went to the restaurant. Ryan gave a snack to", "patch_prefix": "Then, Samantha and Christine went to the restaurant. Jesse gave a snack to", "clean_answer": " Jonathan", "patch_answer": " Ryan", "case": "BABA_16"}
{"clean_prefix": "Then, Erica and Christopher went to the hospital. Erica gave a basketball to", "patch_prefix": "Then, Nicole and Crystal went to the hospital. Nicole gave a basketball to", "clean_answer": " Christopher", "patch_answer": " Erica", "case": "BABA_16"}
{"clean_prefix": "Then, Eric and Sean went to the house. Eric gave a snack to", "patch_prefix": "Then, Emily and William went to the house. Kristen gave a snack to", "clean_answer": " Sean", "patch_answer": " Eric", "case": "BABA_16"}
{"clean_prefix": "Then, Alexander and Jamie went to the store. Alexander gave a drink to", "patch_prefix": "Then, Matthew and Patrick went to the store. Melissa gave a drink to", "clean_answer": " Jamie", "patch_answer": " Alexander", "case": "BABA_16"}
{"clean_prefix": "Then, Courtney and Jennifer went to the house. Courtney gave a computer to", "patch_prefix": "Then, Heather and Brian went to the house. Amber gave a computer to", "clean_answer": " Jennifer", "patch_answer": " Courtney", "case": "BABA_16"}
{"clean_prefix": "Then, Daniel and Jessica went to the store. Daniel gave a necklace to", "patch_prefix": "Then, Angela and David went to the store. Christina gave a necklace to", "clean_answer": " Jessica", "patch_answer": " Daniel", "case": "BABA_16"}
{"clean_prefix": "Then, Samuel and Richard went to the house. Samuel gave a snack to", "patch_prefix": "Then, Erin and Sarah went to the house. Emily gave a snack to", "clean_answer": " Richard", "patch_answer": " Samuel", "case": "BABA_16"}
{"clean_prefix": "Then, Scott and Lindsey went to the hospital. Scott gave a drink to", "patch_prefix": "Then, Alexander and Kyle went to the hospital. Christine gave a drink to", "clean_answer": " Lindsey", "patch_answer": " Scott", "case": "BABA_16"}
{"clean_prefix": "Then, Timothy and Nathan went to the store. Timothy gave a computer to", "patch_prefix": "Then, Brittany and Adam went to the store. Kimberly gave a computer to", "clean_answer": " Nathan", "patch_answer": " Timothy", "case": "BABA_16"}
{"clean_prefix": "Then, Alicia and Jeremy went to the office. Alicia gave a drink to", "patch_prefix": "Then, Kelly and Christina went to the office. Samuel gave a drink to", "clean_answer": " Jeremy", "patch_answer": " Alicia", "case": "BABA_16"}
{"clean_prefix": "Then, Katherine and Jeremy went to the school. Katherine gave a kiss to", "patch_prefix": "Then, Elizabeth and Patrick went to the school. Vanessa gave a kiss to", "clean_answer": " Jeremy", "patch_answer": " Katherine", "case": "BABA_16"}
{"clean_prefix": "Then, Charles and Steven went to the restaurant. Charles gave a computer to", "patch_prefix": "Then, Bryan and Megan went to the restaurant. Tiffany gave a computer to", "clean_answer": " Steven", "patch_answer": " Charles", "case": "BABA_16"}
{"clean_prefix": "Then, Joshua and Thomas went to the school. Joshua gave a necklace to", "patch_prefix": "Then, Jeffrey and Paul went to the school. Ashley gave a necklace to", "clean_answer": " Thomas", "patch_answer": " Joshua", "case": "BABA_16"}
{"clean_prefix": "Then, Kevin and Joseph went to the station. Kevin gave a computer to", "patch_prefix": "Then, Samantha and Jason went to the station. Lauren gave a computer to", "clean_answer": " Joseph", "patch_answer": " Kevin", "case": "BABA_16"}